app/controllers/posts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def new
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "posts" ("status", "requestdate", "place", "city", "relation", "gender", "mentalstatus", "name", "fathername", "age", "clothes", "clothescolor", "description", "user_id", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def makepost
    #@post = Post.new(permit_post)
    #debugger
    @user = User.find(params[:id])
    @post = @user.posts.build(permit_post)
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."status" = ? ORDER BY created_at DESC LIMIT ? OFFSET ?  [["status", "lost"], ["LIMIT", 9], ["OFFSET", 0]]
---
  def index
    if params[:id] == 'getmiss'
      @posts = Post.where(:status => 'lost').order("created_at DESC").paginate(page: params[:page], per_page: 9)