app/controllers/users_controller.rb

INSERT INTO "users" ("name", "phoneno", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Muhammad Taimoor Sultani"], ["phoneno", "03004399059"], ["password", "111111"], ["created_at", 2017-05-06 15:58:44 UTC], ["updated_at", 2017-05-06 15:58:44 UTC]]
---
  def create
  	@user = User.new(permit_user)
    begin
      if @user.save

SELECT  "users".* FROM "users" WHERE "users"."phoneno" = ? AND "users"."password" = ? LIMIT ?  [["phoneno", "03004399059"], ["password", "111111"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(phoneno: params['phoneno'], password: params['password'])

SELECT  "users".* FROM "users" WHERE "users"."phoneno" = ? LIMIT ?  [["phoneno", "03004399059"], ["LIMIT", 1]]
---
  def alreadyexist
    @user = User.find_by(phoneno: params['phone'])